//*****************************************************
//
// 衝撃波の処理[inpact.cpp]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "inpact.h"

//*****************************************************
// 定数定義
//*****************************************************
namespace
{
const int MESH_U = 32;	// 横の分割数
const int MESH_V = 1;	// 縦の分割数
const float MESH_HEIGHT = 50.0f;	// メッシュの高さ
}

//=====================================================
// コンストラクタ
//=====================================================
CInpact::CInpact(int nPriority) : CMeshCylinder(nPriority)
{

}

//=====================================================
// デストラクタ
//=====================================================
CInpact::~CInpact()
{

}

//=====================================================
// 生成処理
//=====================================================
CInpact *CInpact::Create(void)
{
	CInpact *pInpact = nullptr;

	if (pInpact == nullptr)
	{
		pInpact = new CInpact;

		if (pInpact != nullptr)
		{
			pInpact->Init();
		}
	}

	return pInpact;
}

//=====================================================
// 初期化処理
//=====================================================
HRESULT CInpact::Init(void)
{
	// 分割数設定
	SetNumMeshU(MESH_U);
	SetNumMeshV(MESH_V);

	// 継承クラスの初期化
	CMeshCylinder::Init();

	return S_OK;
}

//=====================================================
// 終了処理
//=====================================================
void CInpact::Uninit(void)
{
	CMeshCylinder::Uninit();
}

//=====================================================
// 更新処理
//=====================================================
void CInpact::Update(void)
{
	CMeshCylinder::Update();
}

//=====================================================
// 描画処理
//=====================================================
void CInpact::Draw(void)
{
	CMeshCylinder::Draw();
}