//*****************************************************
//
// ライフ表示の処理[life.h]
// Author:髙山桃也
//
//*****************************************************

#ifndef _LIFE_H_
#define _LIFE_H_

//*****************************************************
// インクルード
//*****************************************************
#include "object.h"

//*****************************************************
// 前方宣言
//*****************************************************
class CUI;

//*****************************************************
// クラスの定義
//*****************************************************
class CLife : public CObject
{
public:
	CLife(int nPriority = 7);	// コンストラクタ
	~CLife();	// デストラクタ

	CLife *Create(int nIdx);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	struct Sinfo
	{
		int nIdxPlayer;	// 参照するプレイヤーの番号
	};

	Sinfo m_info;	// 自身の情報
};

#endif
